Backend/app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT `cities`.* FROM `cities`

    def set_city
      @city = City.find(params[:id])
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1