Backend/app/controllers/cities_controller.rb

SELECT `cities`.* FROM `cities` WHERE `cities`.`uuid` = 'e77d0ceb-3a14-421f-8222-25eb8554c2a6' LIMIT 1
---
    def set_city
      #@city = City.find(params[:id])
      @city = City.find_by(uuid: params[:uuid])