Backend/app/controllers/users_controller.rb

    def set_user
      @user = User.find_by(uuid: params[:uuid])
---
SELECT `users`.* FROM `users` WHERE `users`.`uuid` = 'a0f60077-55b0-42df-8651-595208e967a4' LIMIT 1