Backend/app/controllers/api/v1/cities_controller.rb

  def index
    @cities = City.all
---
SELECT `cities`.* FROM `cities`

    def set_city
      #@city = City.find(params[:id])
      @city = City.find_by(uuid: params[:uuid])
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`uuid` = '5cd55cec-1e7f-47b9-bf36-39f0e628e415' LIMIT 1