Backend/app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `phone`, `city_id`, `role`, `created_at`, `updated_at`, `uuid`) VALUES ('John Doe', 'john.doe@example.com', 'P@ssw0rd123', '+1234567890', 1, 'user', '2024-02-29 10:57:49.539967', '2024-02-29 10:57:49.539967', '30a02258-508c-4dd6-8983-9a611bd70016')

    def set_user
      @user = User.find_by(uuid: params[:uuid])
---
SELECT `users`.* FROM `users` WHERE `users`.`uuid` = '5cd55cec-1e7f-47b9-bf36-39f0e628e415' LIMIT 1